In [ ]:
import pandas as pd
# import modin.pandas as pd
import numpy as np

In [ ]:
test_dict = {'movie':[1,1,2,2,3,3,4,4,4], 'genre': [1,2,3,4,5,6,7,8,9], 'interaction': [0,1,1,0,1,0,1,1,0]}
df = pd.DataFrame(test_dict)

In [ ]:
df

   movie  genre  interaction
0      1      1            0
1      1      2            1
2      2      3            1
3      2      4            0
4      3      5            1
5      3      6            0
6      4      7            1
7      4      8            1
8      4      9            0

In [ ]:
g=df.groupby('movie')['interaction'].count()
topUsers=g.sort_values(ascending=False)[:15]

g=df.groupby('genre')['interaction'].count()
topMovies=g.sort_values(ascending=False)[:15]

top_r = df.join(topUsers, rsuffix='_r', how='inner', on='movie')
top_r = top_r.join(topMovies, rsuffix='_r', how='inner', on='genre')

crosstab = pd.crosstab(top_r.movie, top_r.genre, top_r.interaction, aggfunc=np.sum)
crosstab

genre    1    2    3    4    5    6    7    8    9
movie
1      0.0  1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2      NaN  NaN  1.0  0.0  NaN  NaN  NaN  NaN  NaN
3      NaN  NaN  NaN  NaN  1.0  0.0  NaN  NaN  NaN
4      NaN  NaN  NaN  NaN  NaN  NaN  1.0  1.0  0.0

In [ ]:
t = df.groupby('movie')['interaction'].count()
t

movie
1    2
2    2
3    2
4    3
Name: interaction, dtype: int64

In [ ]:
crosstab.T.to_dict('list')

{1: [0.0, 1.0, nan, nan, nan, nan, nan, nan, nan],
 2: [nan, nan, 1.0, 0.0, nan, nan, nan, nan, nan],
 3: [nan, nan, nan, nan, 1.0, 0.0, nan, nan, nan],
 4: [nan, nan, nan, nan, nan, nan, 1.0, 1.0, 0.0]}

## Test 2

In [ ]:
d = {'A': [1,1,2,2,2], 'B': [1,2,3,4,5]}
df = pd.DataFrame(d)
df

   A  B
0  1  1
1  1  2
2  2  3
3  2  4
4  2  5

In [ ]:
df.set_index('A').T.to_dict('split')

UserWarning: DataFrame columns are not unique, some columns will be omitted.

{'index': ['B'], 'columns': [1, 1, 2, 2, 2], 'data': [[1, 2, 3, 4, 5]]}

In [ ]:
df

   A  B
0  1  1
1  1  2
2  2  3
3  2  4
4  2  5

In [ ]:
d = df.groupby('A')['B'].apply(list).to_dict()
d

{1: [1, 2], 2: [3, 4, 5]}

In [ ]:
dictionary = {'A':[1,1,2,2,2,3,3,3,3],'B':[1,2,3,4,5,6,7,8,9]}
df = pd.DataFrame(dictionary)
df

   A  B
0  1  1
1  1  2
2  2  3
3  2  4
4  2  5
5  3  6
6  3  7
7  3  8
8  3  9

In [ ]:
# How to get a dict from a DataFrame that keeps all the values if the values in the column considered as index appear multiple times?
# https://stackoverflow.com/questions/59249282/how-to-get-a-dict-from-a-dataframe-that-keeps-all-the-values-if-the-values-in-th/59249324#59249324
# GroupBy results to dictionary of lists
# https://stackoverflow.com/questions/29876184/groupby-results-to-dictionary-of-lists
df.groupby('A')['B'].apply(list).to_dict()

{1: [1, 2], 2: [3, 4, 5], 3: [6, 7, 8, 9]}

In [ ]:
print(df.groupby('A')['B'].apply(list))

A
1          [1, 2]
2       [3, 4, 5]
3    [6, 7, 8, 9]
Name: B, dtype: object